<div align="right" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/ExploreAI_logos/Logo blue_dark.png"  style="width:25px" align="right";/>
</div>

# Database views
© ExploreAI Academy

A view is a virtual table that represents data derived from one or more base tables. It does not store data. It is basically a saved query that can be used as a table. Views allow you to simplify complex queries, abstract the underlying data structure, and provide some security by allowing access to specific columns or rows of data. 

In this lesson, we will construct a complex query and then create a view of that query.

> ⚠️ This notebook will not run on Google Colab because it cannot connect to a local database. Please make sure that this notebook is running on the same local machine as your MySQL Workbench installation and MySQL `united_nations` database.

## Learning objectives

By the end of this lesson, you should know:
- What a view is and why it's needed.
- How to create a view.
- How to join tables using views.
- How to impute Null values using views.

## Connecting to our MySQL database

Using our `Access_to_Basic_Services` table in the `united_nations` database that we created in MySQL Workbench, we want to answer some questions about our dataset. We can apply the same queries we used in MySQL Workbench in this notebook if we connect to our MySQL server by running the cells below.

In [1]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook. 
# If you get an error here, make sure that mysql and pymysql are installed correctly. 

%load_ext sql

In [2]:
# Establish a connection to the local database using the '%sql' magic command.
# Replace `password` with our connection password and `db_name` with our database name. 
# If you get an error here, please make sure the database name or password is correct.

%sql mysql+pymysql://root:password@localhost:3306/united_nations


To make a query, we add the `%%sql` command to the start of a cell, create one open line then add the query like below, and run the cell.

In [3]:
%%sql

SELECT 
    *
FROM
    Access_to_Basic_Services
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/united_nations
5 rows affected.

[('Central and Southern Asia', 'Central Asia', 'Kazakhstan', 2015, Decimal('94.67'), Decimal('98.00'), Decimal('17.542806'), Decimal('184.39'), Decimal('2699700.00'), Decimal('4.93')),
 ('Central and Southern Asia', 'Central Asia', 'Kazakhstan', 2016, Decimal('94.67'), Decimal('98.00'), Decimal('17.794055'), Decimal('137.28'), Decimal('2699700.00'), Decimal('4.96')),
 ('Central and Southern Asia', 'Central Asia', 'Kazakhstan', 2017, Decimal('95.00'), Decimal('98.00'), Decimal('18.037776'), Decimal('166.81'), Decimal('2699700.00'), Decimal('4.90')),
 ('Central and Southern Asia', 'Central Asia', 'Kazakhstan', 2018, Decimal('95.00'), Decimal('98.00'), Decimal('18.276452'), Decimal('179.34'), Decimal('2699700.00'), Decimal('4.85')),
 ('Central and Southern Asia', 'Central Asia', 'Kazakhstan', 2019, Decimal('95.00'), Decimal('98.00'), Decimal('18.513673'), Decimal('181.67'), Decimal('2699700.00'), Decimal('4.80'))]

## Exercise

We have decomposed the `united_nations.Access_to_Basic_Services` table into three tables. The `united_nations.Basic_Services` table, `united_nations.Economic_Indicators` table, and the `united_nations.Geographic_Locations` table. In this tutorial, we will be constructing a complex query to view the unemployment rate in Sub-Saharan Africa. We will then save that query as a VIEW.

### Task 1 
To view the unemployment rate per region we will have to first join the `Economic_Indicators` table to the `Geographic_Location` table.

In [10]:
%%sql

SELECT
    geo.sub_region,
    eco.Country_name,
    eco.Time_period,
    eco.Pct_unemployment
FROM
    Economic_Indicators eco
    JOIN Geographic_Location geo ON geo.Country_name = eco.Country_name
LIMIT
    1

 * mysql+pymysql://root:***@localhost:3306/united_nations
1 rows affected.

[('Southern Asia', 'Afghanistan', 2015, None)]

### Task 2

After joining our tables, the query  now returns a table with the unemployment rate, country, and region. This allows us to filter for countries in Sub-Saharan Africa. So let's filter this table ensuring that we include Sub Sub-Saharan Africa only. Use the `WHERE` clause to filter our results for `Sub-Saharan Africa`. The table should include the following columns: `Country_name`, `Time_period`, and `Pct_unemployment`.

In [14]:
%%sql

SELECT
    geo.region,
    eco.Country_name,
    eco.Time_period,
    eco.Pct_unemployment
FROM
    Economic_Indicators eco
    JOIN Geographic_Location geo ON geo.Country_name = eco.Country_name
WHERE
    geo.region = 'Sub-Saharan Africa'
LIMIT
    5

 * mysql+pymysql://root:***@localhost:3306/united_nations
5 rows affected.

[('Sub-Saharan Africa', 'Angola', 2015, None),
 ('Sub-Saharan Africa', 'Angola', 2016, None),
 ('Sub-Saharan Africa', 'Angola', 2017, None),
 ('Sub-Saharan Africa', 'Angola', 2018, None),
 ('Sub-Saharan Africa', 'Angola', 2019, Decimal('16.50'))]

### Task 3

After filtering, we will notice that there are Null values in the `Pct_unemployment` column. Fill in the Null values with 33.65. Rename the imputed column, `Pct_unemployment_imputed`.

In [15]:
%%sql

SELECT
    geo.region,
    eco.Country_name,
    eco.Time_period,
    IFNULL(eco.Pct_unemployment,33.65) AS Pct_unemployment_imputed
FROM
    Economic_Indicators eco
    JOIN Geographic_Location geo ON geo.Country_name = eco.Country_name
WHERE
    geo.region = 'Sub-Saharan Africa'
LIMIT
    5

 * mysql+pymysql://root:***@localhost:3306/united_nations
5 rows affected.

[('Sub-Saharan Africa', 'Angola', 2015, Decimal('33.65')),
 ('Sub-Saharan Africa', 'Angola', 2016, Decimal('33.65')),
 ('Sub-Saharan Africa', 'Angola', 2017, Decimal('33.65')),
 ('Sub-Saharan Africa', 'Angola', 2018, Decimal('33.65')),
 ('Sub-Saharan Africa', 'Angola', 2019, Decimal('16.50'))]

### Task 4

Now that we have the query constructed, let's create a VIEW of that query. Name the VIEW, `united_nations.Country_Unemployment_Rate`.

In [16]:
%%sql

CREATE VIEW
    united_nations.Country_Unemployment_Rate AS
SELECT
    geo.region,
    eco.Country_name,
    eco.Time_period,
    IFNULL (eco.Pct_unemployment, 33.65) AS Pct_unemployment_imputed
FROM
    Economic_Indicators eco
    JOIN Geographic_Location geo ON geo.Country_name = eco.Country_name
WHERE
    geo.region = 'Sub-Saharan Africa'

 * mysql+pymysql://root:***@localhost:3306/united_nations
0 rows affected.

[]

### Task 5

Finally, let's have a look at the VIEW.

In [18]:
%%sql 

SELECT
    *
FROM
    united_nations.Country_Unemployment_Rate
LIMIT
    5

 * mysql+pymysql://root:***@localhost:3306/united_nations
5 rows affected.

[('Sub-Saharan Africa', 'Angola', 2015, Decimal('33.65')),
 ('Sub-Saharan Africa', 'Angola', 2016, Decimal('33.65')),
 ('Sub-Saharan Africa', 'Angola', 2017, Decimal('33.65')),
 ('Sub-Saharan Africa', 'Angola', 2018, Decimal('33.65')),
 ('Sub-Saharan Africa', 'Angola', 2019, Decimal('16.50'))]

## Solutions

### Task 1

In [ ]:
%%sql

SELECT 
    loc.Country_name,
    eco.Time_period,
    eco.Pct_unemployment
FROM 
    united_nations.Geographic_Location as loc
LEFT JOIN united_nations.Economic_Indicators as eco
ON eco.Country_name = loc.Country_name;

# Use LIMIT if you think the results set will be too large

### Task 2

In [ ]:
%%sql

SELECT 
    loc.Country_name,
    eco.Time_period,
    eco.Pct_unemployment
FROM 
    united_nations.Geographic_Location as loc
LEFT JOIN united_nations.Economic_Indicators as eco
ON eco.Country_name = loc.Country_name
WHERE REGION = 'Sub-Saharan Africa';

### Task 3

In [ ]:
%%sql

SELECT 
    loc.Country_name,
    eco.Time_period,
    IFNULL (eco.Pct_unemployment,33.65) as Pct_unemployment_imputed
FROM 
    united_nations.Geographic_Location as loc
LEFT JOIN united_nations.Economic_Indicators as eco
ON eco.Country_name = loc.Country_name
WHERE REGION = 'Sub-Saharan Africa';

### Task 4

In [ ]:
%%sql

CREATE VIEW united_nations.Country_Unemployment_Rate
AS

SELECT 
    loc.Country_name,
    eco.Time_period,
    IFNULL (eco.Pct_unemployment,33.65) as PCT_unemployment_imputed
FROM 
    united_nations.Geographic_Location as loc
LEFT JOIN united_nations.Economic_Indicators as eco
ON eco.Country_name = loc.Country_name
WHERE REGION = 'Sub-Saharan Africa';

### Task 5

In [ ]:
%%sql

SELECT *
FROM
    united_nations.Country_unemployment_Rate
LIMIT 10;

## Summary

In this notebook, we created a join with the `Economic_Indicators` table and the `Geographical_Locations` table. This allowed us to filter our data by `Region`, specifically the `Sub-Saharan African` region. We then imputed the Null values in the `Pct_unemployment` column. Finally, we saved this complex query in a VIEW and named that VIEW `united_nations.Country_unemployment_Rate`.

#  

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/ExploreAI_logos/EAI_Blue_Dark.png"  style="width:200px";/>
</div>